### Цикл while

#### Общая схема
```
while <логическое условие>
    действие 1
    действие 2
    ...
```

#### Задача
Напишите программу, которая считывает со стандартного ввода целые числа, по одному числу в строке, и после первого введенного нуля выводит сумму полученных на вход чисел.

```python
a = int(input())
s = 0

while a != 0:
    s = s + a
    a = int(input())
print(s)
```

#### Задача

В Институте биоинформатики между информатиками и биологами устраивается соревнование. Победителям соревнования достанется большой и вкусный пирог. В команде биологов a человек, а в команде информатиков — b человек.

Нужно заранее разрезать пирог таким образом, чтобы можно было раздать кусочки пирога любой команде, выигравшей соревнование, при этом каждому участнику этой команды должно достаться одинаковое число кусочков пирога. И так как не хочется резать пирог на слишком мелкие кусочки, нужно найти минимальное подходящее число.

Напишите программу, которая помогает найти это число. 
Программа должна считывать размеры команд (два положительных целых числа a и b, каждое число вводится на отдельной строке) и выводить наименьшее число d, которое делится на оба этих числа без остатка.

```python
a, b = int(input()), int(input())
i, s = 1, 1

while s % b != 0: # пока остаток от деления не равен 0
    s = a * i
    i += 1
print(s)
```
#### Читаем 5 пар чисел и выводим их произведение

```python
a, b = int(input()), int(input())
i, s = 1, 1

while s % b != 0: # пока остаток от деления не равен 0
    s = a * i
    i += 1
print(s)
```

### Задача
Для каждого введённого числа проверить:
* если число меньше 10, то пропускаем это число;
* если число больше 100, то прекращаем считывать числа;
* в остальных случаях вывести это число обратно на консоль в отдельной строке.

```python
a = 0

while a <= 100:
    a = int(input())
    if a < 10:
        continue
    elif a >= 10 and a <= 100:
        print(a)
```



