### Цикл for

#### Общая схема

```python
for i in 2,3,5: # i принимает поочерёдно указанные значения в in
    print(i * i)
```

```python
for i in range(10): # последовательносность от 0 до 9
    print(i * i)
```

#### Функция range
Функция которая возвращает последовательности.

**Примеры:**
* `range(5)` - все числа от 0 до 5 (не включая 5) с шагом 1 - `0, 1, 2, 3, 4`
* `range(2,5)` - все числа от 2 до 5 (не включая 5) с шагом 1 - `2, 3, 4`
* `range(2,15,14)` - все числа от 2 до 15 (не включая 15) с шагом 4 - `2, 6, 10, 14`

Функция записывается обычно в виде: `range(start=0, to, step=1)`
Параметры `start` и `step` есть по умолчанию. Параметра `to` нет, его нужно обязательно указывать.

#### Задача про таблицу умножения
Когда Павел учился в школе, он запоминал таблицу умножения прямоугольными блоками. Для тренировок ему бы очень пригодилась программа, которая показывала бы блок таблицы умножения.

Напишите программу, на вход которой даются четыре числа a, b, c и d, каждое в своей строке. Программа должна вывести фрагмент таблицы умножения для всех чисел отрезка `[a;b]` на все числа отрезка `[c;d]`.

Числа a, b, c и d являются натуральными и не превосходят `10`, `a≤b`, `c≤d`.

Следуйте формату вывода из примера, для разделения элементов внутри строки используйте `'\t'` — символ табуляции. Заметьте, что левым столбцом и верхней строкой выводятся сами числа из заданных отрезков — заголовочные столбец и строка таблицы.

```python
a = int(input())
b = int(input())
c = int(input())
d = int(input())
for j in range(c, d + 1):
    print('\t', j, end="")
print()

for i in range(a, b + 1):
    print(i, end="")
    for j in range(c, d + 1):
        print('\t', i * j, end="")
    print()
```

#### Вывести сумму всех нечетных чисел от a до b

```python
# Решение 1

a, b = input().split() # получаем числа через пробел
a = int(a) # преобразовываем в int из строки
b = int(b) # преобразовываем в int из строки
s = 0 # переменная которая будет хранить сумму

for i in range(a, b + 1):
    if i % 2 == 1: # если остаток от деления на 2 есть,
        s += i # то прибавляем это число в нашу переменную
print(s) # выводим получившуюся сумму
```

```python
# Решение 2

a, b = input().split() # получаем числа через пробел
a = int(a) # преобразовываем в int из строки
b = int(b) # преобразовываем в int из строки
s = 0 # переменная которая будет хранить сумму

if a % 2 == 0: # проверяем "а" на чётность
    a += 1 # если четная прибавляем еденицу (делаем нечётной)
for i in range(a, b + 1, 2): # все числа от a до b c шагом 2
    s += i # прибавляем в нашу переменную
print(s) # выводим получившуюся сумму
```

```python
# Решение 3 (изменённый ввод данных)
a, b = (int(i) for i in input().split()) # List comprehensions (Списковое включение)
s = 0 # переменная которая будет хранить сумму

if a % 2 == 0: # проверяем "а" на чётность
    a += 1 # если четная прибавляем еденицу (делаем нечётной)
for i in range(a, b + 1, 2): # все числа от a до b c шагом 2
    s += i # прибавляем в нашу переменную
print(s) # выводим получившуюся сумму
```

#### Задача

Напишите программу, которая считывает с клавиатуры два числа a и b, считает и выводит на консоль среднее арифметическое всех чисел из отрезка [a;b], которые делятся на 3.

В приведенном ниже примере среднее арифметическое считается для чисел на отрезке [−5;12]. Всего чисел, делящихся на 3, на этом отрезке 6: −3,0,3,6,9,12. Их среднее арифметическое равно 4.5

На вход программе подаются интервалы, внутри которых всегда есть хотя бы одно число, которое делится на 3.

```python
a = int(input())
b = int(input())
s = 0
r = 0

for i in range(a, b + 1):
    if i % 3 == 0:
        s += i
        r += 1
print(s / r)
```