### Списки

```
# Вывод содержимого списка
students = ['Ivan', 'Masha', 'Sasha']
for student in students:
    print('Hello, ' + student + '!')
```

### Доступ к элементам списка

```python
# ДОСТУП К ЭЛЕМЕНТАМ СПИСКА
students = ['Ivan', 'Masha', 'Sasha']
len(students) # длина списка

# ДОСТУП ПО ПОРЯДКУ
students[0] # Ivan
students[1] # Masha
students[2] # Sasha

# ДОСТУП С КОНЦА СПИСКА
students[-1] # Sasha
students[-2] # Masha
students[-3] # Ivan

# ДОСТУП К НЕСКОЛЬКИМ ЭЛЕМЕНТАМ СПИСКА
students[:2] # Доступ к элементам 0, 1 (Ivan, Masha)
students[::-1] # Все элементы списка с конца
```

```python
# Операции со списками

# Сложение
students = ['Ivan', 'Masha', 'Sasha']
teachers = ['Oleg', 'Alex']
students + teachers # Результат - ['Ivan', 'Masha', 'Sasha', 'Oleg', 'Alex']

# Умножение
[0,1] * 4 # Результат - [0,1,0,1,0,1,0,1]
```

```python
# Изменение списков
students = ['Ivan', 'Masha', 'Sasha']
students[0] = 'Oleg'
print(students)
```

```python
# Добавление элементов в список
students = ['Ivan', 'Masha', 'Sasha']
students.append('Olga') # Результат - ['Ivan', 'Masha', 'Sasha', 'Olga']
students += ['Boris'] # Результат - ['Ivan', 'Masha', 'Sasha', 'Olga', 'Boris']
students = [] # Создание пустого списка
```

```python
# Вставка элементов в список
students = ['Ivan', 'Masha', 'Sasha']
students.insert(1, 'Olga')
print(students) # Результат - ['Ivan', 'Olga', 'Masha', 'Sasha']
```

```python
# Удаление элеемнта из списка (без проверки)
students = ['Ivan', 'Masha', 'Sasha']
students.remove('Sasha') # Результат - ['Ivan', 'Masha']
```

```python
# Поиск элемента в списке (способ 1)
students = ['Ivan', 'Masha', 'Sasha']
if 'Ivan' in students:
    print('Ivan is here!')
if 'Ann' not in students:
    print('Ann is out.')

# Поиск элемента в списке (способ 2)
students = ['Ivan', 'Masha', 'Sasha']
ind = students.index('Sasha') # Результат: 2

students = ['Ivan', 'Masha', 'Sasha']
ind = students.index('Ann') # Результат - ValueError
```

```python
# Сортировка списка не меняя изначального списка
students = ['Ivan', 'Masha', 'Sasha']
ordered_students = sorted(students)

# Изменение самого списка
students.sort()

# Возвращение максимального значения списка
students.max()

# Возвращение минимального значения списка
students.min()
```

```python
# Список в обратном порядке с помощью функции reverse (изменяя список)
students = ['Ivan', 'Masha', 'Sasha']
students.reverse() # Результат: ['Sasha', 'Masha', 'Ivan']

# Список в обратном порядке с помощью функции reversed (не изменяя список)
students = ['Ivan', 'Masha', 'Sasha']
reversed(students) # Результат: ['Sasha', 'Masha', 'Ivan']

# Список в обратном порядке с помощью слайсинга (не изменяя список)
students[::-1]
```

```python
# Присвоение списков
a = [1, 'A', 2]
b = a     # тот же список что и в переменной "a"
a[0] = 42 # изменение списка на который ссылаются переменные a, b
print(a)  # [42, 'A', 2]
print(b)  # [42, 'A', 2]
b[2] = 30 # изменение списка на который ссылаются переменные a, b
print(a)  # [42, 'A', 30]
print(b)  # [42, 'A', 30]
```

```python
# Генерация списков
a = [0] * 5 # генерация списков из одинаковых элементов [0, 0, 0, 0, 0]
a = [0 for i in range(5)] # выражение 0 выполняется с переменной i от 0 до 4 [0, 0, 0, 0, 0]
a = [i * i for i in range(5)] # для каждого значения от 0 до 4 выполняется i*i [0, 1, 4, 9, 16]
a = [int(i) for i in input().split()] # после чтения строки применяем преобразование в int
print(a)
```

#### Задача

Напишите программу, на вход которой подается одна строка с целыми числами. 
Программа должна вывести сумму этих чисел. Используйте метод split строки.

```python
s = 0
a = [int(i) for i in input().split()]
for i in a:
    s += i
print(s)
```
